src/api-guides/travel/hotelservice2/sample-requests/general-walkthrough/ratedetails-rq.xml

<?xml version="1.0" encoding="UTF-8"?>

<!-- HTTP-headers start 

POST HTTP/1.1
accept: application/xml
accept-charset: utf-8
authorization: Basic xxxxxxxxxxxxxxxx
concur-correlationid: 8da3b31537ccc7455dcc86828cda02e3
concur-loginid:  xxxxxxxxxxxx
concur-traveleruuid:  xxxxxxxxxxxx
content-type: application/xml; charset="utf-8"
soapaction: ratedetails

    HTTP-headers end -->

<Envelope xmlns="http://schemas.xmlsoap.org/soap/envelope/">
    <Header xmlns="http://schemas.xmlsoap.org/soap/envelope/">
        <authentication xmlns="http://www.concur.com/webservice/auth">
            <userid>xxxxxxxxxxxx</userid>
            <password>xxxxxxxxxxx</password>
        </authentication>
    </Header>
    <Body xmlns="http://schemas.xmlsoap.org/soap/envelope/">
        <OTA_HotelAvailRQ xmlns="http://www.opentravel.org/OTA/2003/05" RateDetailsInd="true" EchoToken="4F0F697B-83BD-4B1D-BB7B-266EDCEE2308" Version="5" PrimaryLangID="en" AltLangID="en">
            <POS>
                <Source ISOCurrency="USD">
                    <RequestorID Type="1" ID="requestor_id"></RequestorID>
                </Source>
            </POS>
            <AvailRequestSegments>
                <AvailRequestSegment>
                    <HotelSearchCriteria>
                        <Criterion>
                            <RatePlanCandidates>
                                <RatePlanCandidate RatePlanID="0A8CFB4B1B#7b0fb272-f10c-4b10-aebc-33fa73b5c90e">
                                    <HotelRefs>
                                        <HotelRef ChainCode="TL" HotelCode="HT030025"></HotelRef>
                                    </HotelRefs>
                                </RatePlanCandidate>
                            </RatePlanCandidates>
                        </Criterion>
                    </HotelSearchCriteria>
                    <StayDateRange Start="2021-09-28" End="2021-10-01"></StayDateRange>
                    <RoomStayCandidates>
                        <RoomStayCandidate>
                            <GuestCounts>
                                <GuestCount AgeQualifyingCode="10" Count="1"></GuestCount>
                            </GuestCounts>
                        </RoomStayCandidate>
                    </RoomStayCandidates>
                    <TPA_Extensions>
                        <SearchSessionToken>7b0fb272-f10c-4b10-aebc-33fa73b5c90e</SearchSessionToken>
                    </TPA_Extensions>
                </AvailRequestSegment>
            </AvailRequestSegments>
        </OTA_HotelAvailRQ>
    </Body>
</Envelope>