WebService/XmlFiles/InventoryXml/WINAU36390_Inv_202110/CLOUD_MAINTAINENCE/RM_POST_STM_WS _WINAU3639020211026.11.41.35.xml

<?xml version="1.0" encoding="UTF-8"?>
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
  <soap:Header>
    <wsse:Security soap:mustUnderstand="1" xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd">
      <wsse:UsernameToken>
        <wsse:Username>SOLANO</wsse:Username>
        <wsse:Password Type="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-username-token-profile-1.0#PasswordText">SOLANO36390</wsse:Password>
      </wsse:UsernameToken>
    </wsse:Security>
  </soap:Header>
  <soap:Body>
    <OTA_HotelAvailNotifRQ xmlns="http://www.opentravel.org/OTA/2003/05" EchoToken="2021102611413667" TimeStamp="2021-10-26T11:41:36.067+05:30" Version="1.0">
      <POS>
        <Source>
          <RequestorID Type="22" ID="WINHMS" />
        </Source>
      </POS>
      <AvailStatusMessages HotelCode="WINAU36390">
        <AvailStatusMessage BookingLimit="16">
          <StatusApplicationControl Start="2021-12-01" End="2022-01-31" InvTypeCode="DXD" />
        </AvailStatusMessage>
      </AvailStatusMessages>
    </OTA_HotelAvailNotifRQ>
  </soap:Body>
</soap:Envelope>