src/main/resources/First Call Request.xml

<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
    <soap:Body>
        <OTA_HotelAvailRQ xmlns="http://www.opentravel.org/OTA/2003/05" RequestedCurrency="INR" SortOrder="TG_RANKING" Version="0.0" PrimaryLangID="en" SearchCacheLevel="VeryRecent">
            <AvailRequestSegments>
                <AvailRequestSegment>
                    <HotelSearchCriteria>
                        <Criterion>
                            <Address>
                                <CityName>Mumbai</CityName>
                                <CountryName Code="India"></CountryName>
                            </Address>
                            <HotelRef/>
                            <StayDateRange End="2019-03-30" Start="2019-03-29"/>
                            <RoomStayCandidates>
                                <RoomStayCandidate>
                                    <GuestCounts>
                                        <GuestCount AgeQualifyingCode="10"/>
                                        <GuestCount Age="10" AgeQualifyingCode="8" Count="1" />
                                    </GuestCounts>
                                </RoomStayCandidate>
                            </RoomStayCandidates>
                            <TPA_Extensions>
                                <Pagination enabled="false" hotelsFrom="01" hotelsTo="05"/>
                                <HotelBasicInformation>
                                    <Reviews />
                                </HotelBasicInformation>
                                <UserAuthentication password="test@123" propertyId="1000000002" username="testsell"/>
                            </TPA_Extensions>
                        </Criterion>
                    </HotelSearchCriteria>
                </AvailRequestSegment>
            </AvailRequestSegments>
        </OTA_HotelAvailRQ>
    </soap:Body>
</soap:Envelope>